<?php
/*
if(!$CORE)
{
header("Location: /index.php");
exit;
}
*/
?>
<!-- base -->
	<div class="base">
		<div class="contentbox">
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Если Вы это читаете, значит, Вы - настоящий Head Hunter и правильный HR, а не заскриптованные девочки из агентcтв, обученные беглому анализу анкет. В разговоре ждущие репперных фраз и слов-триггеров скрипта, напрочь пропускающие при этом другие фразы собеседника и текст мимо сознания.<br>
				Ну, или моя личность каким-либо образом Вас заинтересовала.<br>
				В любом случае, здравствуйте. Далее - огрооомный текст с мыслями.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Итак, рассуждалки...<br>
				Ситуация: Агентству/IT-организации по роду деятельности нужны, front/backend/мобильные/ ... - разработчики, верстальщики, специалисты UI/UX .<br>
				Нужны ведь? Судя по вакансиям - нужны. Опять же, судя по частоте публикации объявлений и обновлений вакансий, нужны постоянно. А если учесть популярность статей "Войти-в-IT", то складывается впечатление, что вообще всем нужны эти люди ! Почему же их не хватает?
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				<i>Ситуацию с организациями, набирающих сотрудников временно, только на определенную задачу и с жесткими требованиями к ЗУН, сознательно не рассматриваем, т.к. проблематика там совсем другая.</i>
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Задавшись наличием данной проблемы, стал рыть инет, легонько выходил на "HR'ов", хантеров, работников агентств, сотрудников IT-организаций и сложилась такая картинка: Работодатель тратит силы и средства для поиска, контроля освобождаемости, привлечение, собеседования, тесты, обеспечение требований и условий, организацию рабочего места, обеспечение рабочего процесса и жизнедеятельности, адаптацию, поддержание мотивации, простраивание карьерных планов работника. Ресурс встраивается в систему жизнедеятельности организации, в течение года интегрируется. <br>
				Как утверждают источники, в ряде случаев, в организацию берется молодой и перспективный разработчик/верстальщик (имея начальные навыки в нужном организации направлении) с целью развить/воспитать Работника для выполнения работ определенного уровня и задач. Процесс интеграции тот же, но добавляется блок обучения.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Работник же, (как правило, достаточно молодой и амбициозный, ведь именно такого искали, Перспективный) достигнув определенного уровня в развитии, однажды встает с кресла и движется дальше, выше по СВОИМ целям. Иногда этот процесс сопровождается взаимным шантажом, испорченным настроением, коррекцией планов, усложнением работы ПM и РП, с незапланированными контактами с заказчиками, смежниками т.п. Как правило, цели Работника достигаются уже у другого Работодателя. А проекты, планы Руководителя/организации относительно этого ресурса, откладываются на неопределенное и незапланированное время. Иногда - на начальное состояние с потерей средств, потраченных на развитие. Снова начинается круг интеграции нового Работника.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Покопав исток проблемы, выяснились 2 момента существенно влияющие на проблему: Сторона Работодателя и Сторона Работника. 				<br>&nbsp;<br>
				Рассмотрим сначала Работника.<br>
				Оказалось, что удержать мотивацию в развивающемся организме растущего профессионала достаточно сложно. Слишком много слабо контролируемых личностных факторов и переменных: не очерченные жизненные планы или их отсутствие, проблематика личностного развития, важность краткосрочных целей, личностные особенности "миллениалов", меняющиеся приоритеты и взгляды, особенности восприятия и реагирования на изменение условий, завышенность профессиональных ожиданий, тренды IT-сообщества и т.п.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Теперь "идеализируем" новичка.<br>
				Новичок должен:<br>
				1. Быть пунктуальным и аккуратным<br>
				2. Постоянно учиться и достигать поставленных целей в освоении навыков<br>
				3. Повторить полученный навык<br>
				4. Самостоятельно развивать полученный навык, находить пути решения<br>
				5. Самостоятельно тестировать продукт в процессе разработки.<br>
				6. Выявлять, устранять ошибки до "публикации" кода и не допускать их повторного появления. Уметь принять ответственность за ошибки<br>
				7. Соблюдать динамику работы проекта, выполнения задачи<br>
				8. Качественно и в срок выполнять вверенную работу, решить поставленную задачу<br>
				9. Все рабочее время посвящать работе над проектом<br>
				10. Уметь оптимизировать рабочий процесс и применять на практике решения.<br>
				11. Обладать требуемым уровнем необходимого ЯП<br>
				12. Знать и использовать возможности профессионального ПО<br>
				13. Соблюдать нормы/стандарты/требования организации<br>
				14. Успешно социализироваться, стать частью команды
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Возникла мысль, а что если принимать уже жизненно устоявшегося, закрепившегося, надежного взрослого человека? (Отбросьте миф о тупости работников "зазо"). Ведь большинство пунктов "Идеализации" в нем УЖЕ есть. Остальные разовьются быстрее, чем у молодежи.<br>
				Условия могут быть отличными от условий найма ранее описанной категории Работников.
				<br>&nbsp;<br>
				Представим, есть потенциальный сотрудник, следящий за развитием отрасли, интересующийся обозначенной сферой, обладающий начальными навыками верстки и PHP, MySQL, CSS, HTML, JS. Этот работник уже заинтересован в постоянно саморазвитии и овладением тонкостями профессии (т.к. это - привычная и правильная для него линия развития), ориентирован на рост себя как структурной единицы организации (потому, что так воспитывали).
			<br>&nbsp;<br>
				</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Он стабилен, т.к. имеет "корни" - семью и жилплощадь, имеет прикрытые тылы и семья принимает его приоритеты. Он обладает достаточным жизненным опытом, чтобы не доводить конфликт до конфронтации. Обладает достаточным чувством юмора и самоиронии, чтобы в конфликты не вступать. Он воспитан на "субботниках" и "авралах": для него это не стресс. Не подвержен прокрастинации, т.к. сначала - дело, развлекуха - потом. Он не тратит время на личные отношения во время работы - у него уже все есть. А имеющееся хобби занимает только <strong>свободное</strong> время. Так <strong>уже</strong> сложилось за годы.
			<br>&nbsp;<br>
			</p>
			<p>
				Он умеет извлекать информацию, структурировать и сублимировать в опыт. Такой работник способен выполнять однотипные и повторяющиеся задачи (так убивающие мотивацию молодых и перспективных) продолжительный период времени, т.к. понимает, что масса обладает энергией, а ее прирост эту энергию высвобождает (переход количества в качество). И с каждой итерацией код будет все чище и короче.
			<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Он, потенциально, лоялен руководству, проекту, делу, организации (ведь организация заботится о нем). Можно из него вырастить в короткий срок специалиста, который будет с организацией сколь угодно долго и будет развиваться в том направлении, в котором будет простроен план развития в организации, будет выполнять работу все быстрее и качественнее. Будет способен развиваться в темпе организации и не заглядываться по сторонам.<br>
			</p>
			<p>
				Организация будет уверена в том, что вверенный фронт работ будет "прикрыт" и на планирование уже не нужно тратить время - достаточно "спустить задачу" и точно знать, что за определенное время все будет выполнено и протестировано.<br>
			</p>
			<p>
				Идеальный Junior, который не покинет организацию в неудобный момент, даже достигнув уровня Middl`a. И будет наслаждаться Middl`ом в полной мере, если оплата труда будет на уровне рынка.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
			Что нужно, чтобы получить такого работника?
			<br>&nbsp;<br>			
			</p>
			<p>
				Взять и воспитать так же, как и "молодого". Предоставить рабочее место и дать возможность учиться на рабочем месте, развиваться, выполнять проекты один за одним. Контроль - по этапам освоения навыков, решения поставленных задач в строго определенное время. Строгая отчетность по выполнению работ и достижения определенных ступеней развития.
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Отличным стимулом будет оплата обучения на образовательных проектах (типа Geekbrains, Skillbox, SkillFactory, Яндекс.Практикум, Специалист и т.п.), выбранному Руководителем ЯП или направлению/технологии. Тут несколько выгод: и других сотрудников отвлекать/напрягать не нужно и обратную связь от преподавателей всегда получить можно и "заземлить" работника легко.
				<br>&nbsp;<br>
				Сначала работать - с наставником. Позже - самостоятельно. Важно, чтобы коллеги/наставник не отказывали в консультации и задачи усложнялись постепенно и соразмерно. Помимо плановых задач, ему нужно ставить задачу развития (задание вне зоны комфорта): выполняется работа по производственному процессу и параллельно изучается новый навык. По достижении необходимого уровня развития и качества работ, необходимо делегировать полную ответственность за вверенную часть проекта, но задачи развития не снимаются.
				<br>
				Распределение времени, при этом может быть следующим: 20% - выпуск продукта. 80% - обучение. Далее, соотношение должно меняться этапами 40/60 - 50/50 - 70/30 - 80/20 - 90/10
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Дедлайны должны быть "жесткими", вне зависимости от реальных дедлайнов проекта. Единственное, чего нужно избегать, это унижения, основанного на вере в "некомпетентность "зазо".  Хорошим стимулом к развитию "взрослого Jun`a" будет ежеквартальные отчеты-предложения. Своего рода само-аудит рабочего места, процесса, организации. Возможно, предложения окажутся полезными.<br>
				Не смотря на то, что "возрастной" работник привык находиться на рабочем месте вне дома, спустя некоторое время (скажем, через год-полтора), можно начать практиковать удаленный режим работы, если он сумел выстроить коммуникации и отношения с командой на должном уровне.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Во сколько это обойдется?
				<br>&nbsp;<br>
				Изначально, можно предложить среднюю з/п в месяц на предыдущем месте работы. Так кандидату будет проще в первый год: он ничего не теряет (финансовая сторона не изменится), но получает ощутимые перспективы, о которых мечтал или рассчитывал.
				<br>&nbsp;<br>
				Зарплатные ожидания такого работника, как правило, не превышают 650-700 евро (на руки, после уплаты налогов) в месяц. Через год, можно перевести на 1000 евро в месяц. Даже если его квалификация вырастет выше коллег. Никаких доплат за авралы и субботники, сверхурочные. Хорошим стимулом будет квартальная/годовая премия. Но предоставить доступ к ним лишь по истечении года в организации и достижения поставленных профессиональных годовых целей. Реальных целей. Завышенную планку такой работник чует издалека.<br>Далее, можно назначить дополнительный %, зависимый от нагрузки/задачи/степени ответственности/проекта.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Что Вы получаете, в итоге?
				<br>&nbsp;<br>
				Разработчика, занятого всегда. Постоянно выпускающего продукт, прогнозируемого и гарантированного качества.<br>
				Лояльного стабильного сотрудника, обладающего всеми необходимыми навыками для качественного выполнения задач, обладающего высоким уровнем самосознания и мотивации к достижению, не тратящего производственное время зря. Благодарного и ценящего организацию, свое рабочее место, коллег. Способного меняться и (одновременно с этим) выполнять однотипные задачи. Прогнозируемого и адаптированного. С минимальными вложениями в поддержание его мотивации.<br>
				Выполняющего работу написания кода без привычного объема ошибок и задержек, свойственных Junior`ам на этих позициях<br>
				Плюсом можно использования его как базы: напарника в парном программировании, для развития молодого разработчика с целью повышения навыков управления разработкой, TeamLead`a.<br>
				Еще одним плюсом будет "эффект заражения". Отмечено, что если в организации один из сотрудников начинает обучение и, вместе с тем, расти как профессионал, а окружающие начинают отмечать качественные изменения, то и некоторые коллеги так же начинают интересоваться доп.знаниями и расти. Возможно возникновение здорового соревнования, что даст дополнительный толчок для саморазвития сотрудников.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Теперь немного о Работодателе.
				<br>&nbsp;<br>
				Работодатель всегда проходит путь осмысления разработчика сначала - как ресурса, далее - как инструмента, позже - как актива.<br>
				Часто, развивая собственный персонал, Работодатель рассчитывает вернуть вложения и преумножить. Разработчик является ресурсом, т.е. потенциальным источником прибыли и освоения бюджетов текущих проектов. К нему относятся как к будущему источнику дохода. В это время прощаются ошибки, делаются уступки, растет уровень компетентности/качества работника. Ресурс продается в составе команды. В виде результата. Еще никто не говорит о продаже функционале этого ресурса.
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Спустя некоторое время, разработчик в понимании Работодателя <strong>должен</strong> стать инструментом<br>
				Именно в этот момент, возникает та точка напряжения, которая вынуждает разработчика менять место работы.<br>
				Именно на этой стадии идет активный торг. Привлекаются и сменяются комманды, сотрудники, разработчики.<br>
				Почему? Ответ кроется в асинхронности самовосприятия разработчика как профессионала и понимания Работодателем изменившегося статуса разработчика.
				<br>&nbsp;<br>
				Работодатель, в силу определенной инертности (вполне понятной), все еще считает разработчика ресурсом, оплачивая труд и отдавая задачи, контролируя работу соответственно своему представлению. Возросшие навыки, квалификация, способности разработчика принимаются Работодателем как естественный (эволюционный) процесс и (наконец-то!) возврат вложенных усилий и средств в "подъем" ресурса.Наступает время получать дивиденды (как думает Работодатель)...<br>
				Но разработчик <strong>уже</strong> видит, понимает, работает намного быстрее, лучше, качественней. Он <strong>уже</strong> получает отклики сегмента рынка на его ЗУН. Он <strong>уже</strong> может говорить с сегментом с позиции "силы", твердо стоя на железобетонной базе освоенного стека и понимания рамок собственных возможностей. Тем самым, уже <strong>может</strong> выбирать место и проект, с которым ему интересно работать. Выбирает и ... идет "торговаться" с текущем Работодателем. В лучшем случае. Если тот был не готов принять изменившийся статус разработчика - адью. <br>
				Рассказывали, как несколько компаний в одночасье теряли целые команды разработчиков. Кто-то соглашался завершить проект, кто-то оставлял на текущей стадии реализации...
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Ели же Работодатель смог заметить и принять изменение статуса, то разработчик становится в организации <strong>инструментом</strong>: его выковали, заточили, усилили, бережно смонтировали в механизм и его можно "продавать" как отдельный функционал. Продавать гарантированный результат <strong>его</strong> работы и ... начинать постепенно выращивать будущий актив бизнеса.
				<br>&nbsp;<br>
				Работодатель легко может быть на шаг впереди сегмента. Может предлагать разработчику необходимый уровень задач, ответственности, изменять организационные роли. Может вступать с ним в почти партерские отношения, может конкурировать с финансовыми предложениями "со стороны". Т.е., дать почти все, что может предложить сегмент, не выводя переговоры с разработчиком на уровень шантажа, оставаясь в режиме сделки. Не потеряв, при этом, качественный (а иногда - ценный) <strong>инструмент</strong> своей организации.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Очень жаль, но во многих организациях <strong>актив</strong> - это "пересидевшие" сотрудники. Середнячки, которые просто дождались, когда по выслуге перевели выше. Или когда их компетенции выросли на столько, что давать им коддинг уже и неудобно, как-то... Они руководят подразделениями с позиции "дали-делай, закрыл-жди". Они ревностные хранители дисциплины и стандартов. Они - исправители грамматических ошибок. Гениальные писатели отчетов и виртуозы официальных писем (их труды, воистину, способны восхищать. Зачитаешься!). Они не любят учить, передавать опыт, кого-то развивать: ведь они методично выгрызали из мануалов все "фишки" и пережили все апдейты ПО. Они являются "хлебом" организации, обеспечивающие постоянный средний доход. Жаль, но это так.
				<br>&nbsp;<br>
				Однако, если Руководитель был мудр и менялся вместе с сегментом, активом организации (наряду с "хлебом") являются молодые и, в то же время, опытные разработчики. Умеющие управлять разношерстными командами. Способные видеть конечный продукт еще на стадии заявки. Умеющие управлять всей разработкой на любом этапе реализации проекта и т.д. Золото, а не актив. Но луше это золото блестит в руках Руководителя, который его не "покупал", а шлифовал сам. Этот актив всегда способен дать организации те финансовые возможности, которые она может себе вообразить и ... осилить.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Резюмируя, можно сказать/предположить следующее:<br>
				1. Скоро, очень скоро, на рынке станет очень много разработчиков fullstack в возрасте от 40-50<br>
				2. Текучка молодых Middl`ов станет привычной рекой<br>
				3. Подъем с глубин стажера до течения Middl`ов станет интенсивным<br>
				4. Сайты и программный продукт будут устаревать и их необходимо будет поддерживать, реконструировать. А молодым это не интересно.<br>
				5. Вопрос "рабочих лошадок коддинга" станет наиболее острым.
				<br>&nbsp;<br>
				Как воспользоваться этой ситуацией?<br>
				Можно создать команду ресурсов 40+, обучить/переквалифицировать и "продавать" (к примеру) работы по реконструкции устаревших сайтов, поддержанию/обслуживанию/наполнению различных БД, поддержке java-продуктов и т.п.. Т.е., то, что нужно делать постоянно, регулярно, день за днем. То, на что растущих спецов жалко задействовать.
				<br>&nbsp;<br>
				Организация будет иметь коллектив, способный после запуска нового продукта, выпущенного молодыми спецами, сразу взять его в поддержку. Сокращаются затраты на обучение сторонних специалистов для сопровождения продукта. Время ввода поддержки в работу с продуктом стремится к нулю, т.к. поддержка сама участвовала в написании части кода. А в предрелизный период, поддержку можно научить (очень быстро) использованию продукта.<br>
				И такую команду можно смело "продавать".
				<br>&nbsp;<br>
				Назовите этот внутренний проект "OldCodder" или "prog40+", да даже "дедушКод" и создайте себе постоянный финансовый поток.<br>
				Программеры 40+ будут вам благодарны и ценить до ... самой пенсии )))
				<br>&nbsp;<br>
			</p>

				
				
				про взаимные требования Работников и Компаний хорошо видно 
				<a href="https://www.phpclub.ru/talk/threads/%D0%A2%D1%80%D0%B5%D0%B1%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-%D0%BA-web-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%81%D1%82%D0%B0%D0%BC-%D0%B8-%D1%83%D1%81%D0%BB%D0%BE%D0%B2%D0%B8%D1%8F-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B-%D0%B2-%D0%B2%D0%B0%D1%88%D0%B5%D0%B9-%D0%BA%D0%BE%D0%BC%D0%BF%D0%B0%D0%BD%D0%B8%D0%B8.39352/">тут</a>
				<br>&nbsp;<br>
			</p>
			</div>
			
<!-- Спойлеры от Bill Vates -->
<script type="text/javascript" src="1024/jquery-1.8.3.min.js"></script>
	<script type="text/javascript">
		$(document).ready(function(){
			$('.g-content h4').click(function(){ //ждем события click на триггере
				if($(this).parent().children('div.spoiler-content').hasClass('hide')){ //если у спойлера есть класс hide
					$(this).parent().children('div.spoiler-content').slideDown('slow'); //мееееедлееенноооо разворачиваем
					$(this).parent().children('div.spoiler-content').removeClass('hide'); //удалаям у спойлера класс hide
					$(this).children('span.mark').text('-'); //меняем текст в триггере
				}
				else{ //у спойлера нет класса hide
					$(this).parent().children('div.spoiler-content').slideUp('slow'); //мееееедлееенноооо сворачиваем
					$(this).parent().children('div.spoiler-content').addClass('hide'); //добавляем спойлеру класс hide
					$(this).children('span.mark').text('::'); //меняем текст в триггере
				}
			});
		});
	</script>
<!-- Спойлеры от Bill Vates -->
			
    <div class="cut contentbox">
			<div class="g-content" style="margin-bottom:10px;"><h4><!--блок со спойлером-->
				спойлер <span class="mark">::</span>про меня</h4><!--собсна, триггер-->
				<div class="spoiler-content cut hide"><!--блок со скрывающимся содержимым-->
			<div>
			<p>
				Как рос я ;)
				<br>&nbsp;<br>
				В школе, на Sinclair SPECTRUM вместе с другом выпустили игру, написанную на BASIC. С графикой. Псевдо-3D.<br>
				Позже, попробовал получить образование по направлению "программирование", но не набрал 0.13 балла и попал лишь на кабельную специальность электротеха, с которой перевестись на желаемую уже не позволялось.<br>
				Спустя 2 года, ушел из Политеха.<br>Друг доучился, окончил и сейчас full-stack программер для iOS. Очень им горжусь и уважаю.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Образование: психологическое. Спорим, на этом месте читать бросили, с возгласом: "Ну, конечно! Так и знал!". И ошиблись, т.к. учился не "для корочки" и был одним из лучших студентов на курсе, а работать начал еще на 3м, т.к. убежден, что развитие идет именно в практике. После окончания, достаточно много работал консультантом, неклиническим терапевтом, тренером.<br>
				После 5 лет практики ушел из профессии.<br>
				Последующие работы (не связанные с психологией) начинал с нуля и достигал существенных, значимых результатов.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Отвлекся.
				<br>&nbsp;<br>
				Итак, про сайтострой...
				<br>&nbsp;<br>
				<i>Когда-то, первый сайт для себя, я писал на HTML (работая, при этом, психологом-консультантом). Звук Zyxel`я - песня души. Все было, как в деревянном ящике: ни тебе анимаций (вся анимация тогда была лишь в виде меняющих друг друга GIFок или тяжелущего FLASH`а), ни красивостей, ни нормального CSS. Интерактивность? Забудьте! Динамический контент DHTML - это, блин, что?!? Git? Чтобы не забыть, что и как менялось, каждый день создавалась новая папка с датой, в которую копировался файл из предыдущей и работа велась уже с ним. После запуска проекта, весь каталог архивировался и скидывался  "файло-помойку".</i>
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Хотелось сайт не как у всех. И сделал.<br>
				Сайт не имел привычной для всех стартовой страницы. Вместо нее было изображение рабочего стола с моделью самолета, дисками, лампой, полкой и картиной на стене. Каждый объект был тем самым пунктом меню. Кликаешь, и переходишь в раздел.
			</p>
			<p>
				Тогда все страницы моего сайта были таблицами, покрытыми поверх прозрачными слоями с гиперссылками. Мне, почему-то, не нравились текстовые гиперссылки с подчеркиваниями.<br>
				Чтобы все на главной грузилось при модемной (!!!) связи, первоначальную картинку пришлось "пожать" и напилить на огромное кол-во квадратиков и покрыть прозрачными слоями. Выглядело симпатично. Особенно, когда страничка грузилась 1й раз.
				<br>&nbsp;<br>
			</p>
			<p>
				Первая почта появилась, почти сразу, как появился mail.ru. Хостинговых площадок с бесплатным размещением поменял несколько: vndv.com -> 000space.com -> by.ru. После закрытия последнего, зарегистрировал nes1.ru и перешел на платный хостинг locum.ru.
				<br>&nbsp;<br>
				Позже, сайт переделывался. Пробовались фишки DHTML. Честно, даже уже и не упомню, что там делал )))
				<br>&nbsp;<br>
			</p></div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				К счастью, в 2003-м, познакомился с Bill Vates и он открыл для меня чудесный мир PHP.<br>
				Версий nes1.ru было понаделано много, вместе с усвоением новых знаний и навыков. Параллельно были изготовлены сайты для знакомых: эдакие предшественники landing page с квизами (myoil.ru - небольшая нефтяная компания; ustprm.ru - услуги спец-техники; aspectus.ru - научно-производственная фирма) и интернет-магазин (odezka59.ru - одежда для животных и младенцев) с каталогом и системой заказа.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Поскольку страстью всей жизни является небо, то основными увлечениями были дельтапланы и стендовый авиамоделизм (в долгие зимние вечера в отсутствии летной погоды). Домашний nes1.ru "перекочевал" в сторону "стенда" и был создан сайт дельтаклуба (sla.perm.ru) с библиотеками, форумом, новостями.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				В это же время, надолго интерес был сосредоточен на сайте сети магазинов мультимедийной продукции pilotcd.ru: в магазинчиках продавали CD/DVD, фильмы, игры, софт, музыка, аниме, справочники и т.п., а сайт показывал все то, что у нас было в каталоге, рекламировал новинки, помогал советом покупателям. Работа была больше архитектурная и дизайнерская, контентная и та, что теперь обрела название SMM.  Особенностью этого времени было то, что мы не использовали БД. Вся работа велась в файловых системах: все писалось в файлы и читалось из них же.<br>
				Была организована работа с дисконтными картами: мы выгружали данные держателей дисконтных карт из 1С в файлы .csv, разворачивали их на сайте в разделе "Именинники" средствами PHP и одновременно отправляли в торговые точки. Человек мог видеть себя в числе награждаемых и реализовать свое право на "Именнинные" скидки в любой из торговых точек сети.
			</p>
			<p>
				Мы уже вплотную подошли к запуску интеграции магазинного сайта с базой 1С, как произошло "великое распространение широкополосного интернета в массы".<br>
				Не дорого, быстро, удобно.<br>
				Народ возликовал.<br>
				Магазины позакрывались, т.к. зачем клиенту покупать, когда можно быстро скачать с торрента?
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				В это время я освоил интересную для меня область: выдергивал из компьютерных игр модели и превращал их в развертки на бумаге, чтобы можно было собрать понравившуюся модель.<br>
			</p>
			<p>
				Стал автором первого туториала в рунете по изготовлению бумажных моделей из игр, работающих на DirectX (урок растащили на свои сайты халявщики, но биться за первопроходство не стал). Научился работе в 3D редакторе.<br>
				Домашний сайт стал сугубо "бумажно-модельным".
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Наступила эра мобильного интернета.<br>
				Сайт пришлось с нуля переделывать в адаптивный дизайн, чтобы не плодить 2х версий: мобильной и десктопной. Снова - в нескольких вариантах. Вместе с редизайном, пришлось менять архитектуру сайта, его "поведение".<br>
				Параллельно с работой над своим ресурсом, пришлось выступить в роли верстальщика, архитектора и ПМ по реставрации двух сайтов: ekperm.ru и raychem-perm.ru. Снова окунулся в сферу SMM, т.к. обновленные ресурсы нужно держать на плаву. Желательно, по-ближе к поверхности, а бюджет на продвижение не выделили. Добился ТИЦ 20 без вложений.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Практически сразу, после завершения реставрации и сдачи-приемки работ, друг-программист-ABAPер задал вопрос: "ты же хотел войти-в-айти?" и кинул задачку. Отказать не смог, согласился, начал делать и ... понял, что я не знаю PHP! Благодаря изумительной документации языка, принципу "бороться и искать, найти и не сдаваться!", проект был сделан и сдан. Но заказчику уже стало не интересно. Зато опыта по взаимодействию с БД получено - море.<br>
				Научился создавать таблицы MySQL, передавать данные в них (шифруя посредством base64), делать запросы и объеденять результаты в зависимости от запроса. Выводить (предварительно сверстав) результаты для работы пользователя с ними. Верификация пользователей осуществлялась через сессии и с помощью стандартных функций PHP password_hash() и password_verify().
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Возникла идея: поскольку многим клиентам "бумажного" сайта сложно сразу, с листа увидеть, как будет выглядеть деталь в объеме, нужно дать им возможность покрутить будущую деталь прямо на сайте. Развитие: при помощи AP-технологии и приложения для мобильного, дать возможность увидеть будущую деталь, наведя на лист с ее разверткой камеру смарта.<br>
				Вероятно, эта идея станет основой следующего проекта. Кто знает? Пока висит в ToDo ;)
				<br>&nbsp;<br>
			</p>
			<p>
				"Прокачиваю" PHP, пытаюсь "въехать" в JS. Вникаю в ABAP: оказалось довольно интересно!<br>
				Очень интересна мобильная разработка. Все чаще читаю про нее ;) <br>
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Все чаще выступаю в роли PreSale: после запроса, помогаю наиболее точно заполнить бриф и превратить его в качественное ТЗ. Передаю уже почти готовую архитектуру знакомым веб-студиям на оценку, свожу с заказчиком. Получается очень удобно: Заказчик быстрее получает качественный продукт, а с Разработчика снимается куча рутины.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				Младшая дочь движется в сторону С# и Python.<br>
				Значит, наступит время для Unity и Django. А вместе с ними, будет новая версия домашнего сайта и поддоменов для дочерей.<br>
				Жизнь циклична.
				<br>&nbsp;<br>
			</p>
			</div>
			<div class="wow fadeInUp" data-wow-offset="50">
			<p>
				С чем работю: PHP(7), CSS(3), HTML(5), MySQL, MS Project, имею начальные навыки Phyton; использую TotalCommander, IDE Brackets, 3Ds MAX 9, Blender, 3DReaperDX, CorelDrawХ3, Fireworks MX, Pepakura. Иногда (крайне редко): MODx, Figma, PyCharm. <br>
				Слушаю бесплатные лекции CS50, интенсивы SkillBox и GeekBrains, ролики youtube-тюторов-программистов, "перепрохожу" курсы Игоря Борисова, грызу задачки по SAP.<br>
				Обладаю навыками управления проектами и командами исполнителей.
			</p>
			<p>
			<br>&nbsp;<br>
			    Отдаю себе отчет, что идея крайне авантюрная и достаточно утопична, однако, может быть, она Работодателю станет интересна и план развития сотрудника (меня) в качестве разработчика/верстальщика/тестера (каким-то образом) подойдет?<br>Понимаю, что мир сейчас изменяется радикально и хотелось бы меняться вместе с ним. <!--Экономическая ситуёвина просто не понятна. Работодателю сейчас вообще не до обучения.<br> Но если начать сейчас, то по выходу из кризиса уже вырасту до некоторого ("продажного") уровня.--><br>
			    Если Вам интересен эксперимент, то пишите. Обсудим с удовольствием!
			</p>
			</div>
		</div>
	</div>
	</div>
	</div>
	</div>

 <!-- base -->