<div class="dash contentbox" style="padding-left:10px">
	<p>EVEonline. Caldari Heavy Missle II</p>
    <p>Новый отличный подарок пилоту EVE online - модель тяжелой ракетной установки Caldari</p>
    <p>Модель выполнена с возможностью вращения вокруг вертикальной оси и изменения угла наклона блока ракет</p>
    <p>Каркас делает модель прочной. При использовании магнитной бумаги в основании, можно устанавливать модель даже на вертикальных металлических поверхностях</p>
    <p>Поспешите стать обладателем эксклюзивной модели!</p>
</div>