<div class="dash contentbox" style="padding-left:10px">
	<p><b>Модель из мира Line Age 2 - гномка AXI в броне Blue Wolf</b></p>
    <p>Самая первая моя модель персонажа из этой игры. Легла в основу написания инструкции по изговоления копий из бумаги.<br>
    Многому научила меня и других моделистов</p>
	<p>В бета-тесте лицо было ужасным (мягко выражаясь).<br>
	Я его переделал и в конечном релизе Вы увидите уже милое личико.</p><br>
	<p>На фото бета-теста Вы видите пунктирные линии сгиба. В конечном релизе линий нет и модель выглядит чистой и ровной.</p><br>
</div>