<?php
if(!$CORE)
{
header("Location: /index.php");
exit;
}
	
$adress = $_SESSION['adress'];
$dir = $_SESSION['dir'];

?>

<!-- base -->
<div class="base">
 <!-- postbox -->
    <div class="cut" style="padding: 0 5px">
		<p>Лаборатория родилась из желания сделать из бумаги макет Hunter Village из LineAge 2.</p>
		<p>Макет так и не родился, но...</p>
		<p>&nbsp;</p>
		<p>Как-то, "оплакивая" неудачную осаду, успокоил КланЛидера - "будет тебе зАмок!" и сделал на ее день рождения Гирановский Замок. В личное пользование.</p>
		<p>Практически сразу же сделал персонажа жены - гномку AXI</p>
		<p>&nbsp;</p>
		<p>В этот момент, коллеги с портала сardarmy.ru и only-paper.ru попросили рассказать, КАК я это делал. Так появился первый в рунете тутор по разработке моделей из игр в бумажные развертки</p>
		<p>&nbsp;</p>
		<p>Поступил заказ на Замок, приближался очередной день рождения Nimizid'ы. Мысль о Лаборатории приобрела материальный вид.</p>
		<p>&nbsp;</p>
		<p>На данный момент выпущено несколько коллекционных фигурок и строений, оружия из LineAge 2. Выпускаются модели кораблей из EVE online.</p>
		<p>Продолжаются разработки архитектурных сооружений, совершенствуется навык моделирования персонажей.</p>
		<p>&nbsp;</p>
		<p>Если Вы хотите сами начать моделировать, то жмем кнопку ниже и читаем, как это делается.</p>
		<p>&nbsp;</p>
		<p>Если же Вам хочется иметь настольную модель, а конструировать самому не хочется, Вы можете заказать альбом с развертками и инструкцией по сборке. Я с радостью сделаю это для Вас, т.к. мне это нравится!</p>
		<p>Как правило, (в 99%) серьезных вопросов и уточнений для сборки моих моделей не требовалось.</p>
		<p>&nbsp;</p>
		<p>К сожалению, после проведенной операции по коррекции зрения, я не могу выполнять самостоятельную бета-сборку моделей. Поэтому, выпускаются pdf-альбомы моделей для самостоятельной сборки. Благо, весь полученный опыт и знания позволяют быть уверенным в полной "сходимости" деталей и отсутствии проблем со сборкой. На страницах описания указывается возраст (или уровень опыта/навыка), при котором модель будет собрана идеально.</p>
		<p>&nbsp;</p>
		<p>Если же у Вас есть возможность и желание, буду безмерно благодарен за настольную лампу-лупу большого диаметра ;)</p>
		<p>Информация для благотворительных организаций и частных лиц, желающих помочь проекту:</p>
		<br>
		<!-- <strong>ЯндексДеньги</strong>: 41001430306259 -->
		<p>&nbsp;</p>
		<div class="dash"></div>
          <a class="more-link" href="<?=$pagelink?>tutorials">Еще</a>
    </div>
<!-- postbox -->
    <div><p>&nbsp;</p><p>&nbsp;</p></div>
 
</div>
<!-- base -->