<?php
if(!$CORE)
{
header("Location: /index.php");
exit;
}
	
$adress = $_SESSION['adress'];
$dir = $_SESSION['dir'];
//$title = $_SESSION['title'];
$adress = $adress.$dir.'/';
$alting = 'alt="'.$title. '" title="'.$title.'"';
//echo '<title>'.$title.'</title>';

?>

<!-- base -->
<div class="base">
 <!-- postbox -->
	<div>
		<!-- <img src="img/instruments/post_instr_610_3.jpg" width="100%"> -->
		<h1>Ставим барьер COVID-19</h1>
	</div>
    <div class="cut" style="padding: 0 5px">
<!-- Доброго времени суток!
 Этот текст виден только Вам, желющему разместить его у себя на странице, выдав за свой.
 Если у Вас не хватает терпения или скилов для написания статей НА СОБСТВЕННОМ ОПЫТЕ, и Вы вынуждены брать труд других людей, будьте добры, любым удобным способом, сообщите об авторстве данного текста! (например, вставтье этот код в свою страницу: <p>Оригинал статьи по адресу: <a href="https://nes1.ru/tutorials.php"> перейти</a></p> ) -->
	<div class="wow fadeInUp" data-wow-offset="50">
		<h1>Делаем антисептик дома.</h1>
		<p>
		<i>Без паники. Все не так страшно. Короновирус как "призрачная" угроза должен быть остановлен на подлете.</i><br>
		&nbsp;<br>
		</p>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
		<p>Вас родители настойчиво учили мыть руки по приходу домой? Меня учили. И ведь не зря!<br>
		Итак, по рекомендации ВОЗ, одним из самых профилактических средств по борьбе с этой напастью, является обработка рук и поверхностей, которых касаются разные люди, антисептиком!</p><br>
		&nbsp;<br>
		Что ж, начнем готовить!<br>
		&nbsp;<br>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
		<p>Вам потребуются:</p>
		<p><strong>1. Этанол 96%.</strong> <br>
		Обратите внимание: ВОДКА НЕ ПОДХОДИТ!
		</p>
		<p>
		<strong>2. Перекись водорода 3%</strong>
		</p>
		<p><strong>3. Глицерин 98%</strong>  <br>
		Исключительно, чтобы не портить кожу рук.
		</p>
		<p>
		<strong>4. Стерильная вода</strong> <br>
		Как я понял, это сильно прокипяченая вода.
		</p>
		<br>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
		<p>
		Как понимаете, все это можно найти в аптеках по совсем не большим ценам.<br>
		Закупились.<br>
		Теперь все это хозяйство смешиваем в правильных пропорциях, в полном соответствии с <a href="https://www.who.int/gpsc/5may/tools/guide_local_production_ru.pdf" title="инструкция ВОЗ">рекомендациями ВОЗ</a>:<br>
		Этанол - 200 мл<br>
		Перекись водорода - 10 мл<br>
		Глицерин - 3 мл<br>
		Вода - 27 мл<br>
		</p>
		<br>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
		<p>
		Для верности, проведите перерасчет самостоятельно. Я исходил из 250 мл емкости.<br>
		Кстати, для обработки поверхностей, глицерин можно исключить, т.к. он нужен только для кожи рук.
		</p>
		<br>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
			<p>
			Полученное средство борьбы с надвигающейся гадостью, разлить в бутылочки с рапылителями из домашних запасов еще не выброшенной косметической кучи на полке в ванной (ну, или купить какую-то продукцию за минимальные деньги, чтобы использовать только емкость с распылителем).
			</p>
	</div>
	<div class="wow fadeInUp" data-wow-offset="50">
			<p><p>&nbsp;</p>
			Будьте здоровы и да минет Вас стороной COVID-19.<br> Вас и Ваших родных.
			</p>
	</div>
		<p>&nbsp;</p>
	<div class="dash"></div>
        <a class="more-link" href="index.php?page=tutorials">Еще</a>
    </div>
<!-- postbox -->

    <div><p>&nbsp;</p><p>&nbsp;</p></div>
 
</div>
<!-- base -->