<div class="dash contentbox" style="padding-left:10px">
	<p>Модель из мира LineAge 2 - Замок в окрестностях Гирана</p>
    <p>Как-то, оплакивая пивом неудачную осаду, успокоил Клан Лидера - "будет тебе зАмок!" и сделал Гирановский Замок. В личное пользование на ДР.<br>
	Именно с этой модели началось возвращение в моделлинг и экспорт 3D-моделей объектов из игр для последующей развертки</p>
	<p>Спустя годы, подправил модельку, оптимизировал и оформил в альбом.<br>Скачайте, распечатайте и соберите модель замка. Есть несколько ошибок (как-никак, первая модель), но трудностей они Вам не доставят. На ней, как оказалось, достаточно легко учить детей бумажному моделированию. Ну, или начать собирать модели из бумаги самостоятельно, если Вы этим никогда не занимались.</p>
</div>