<div class="dash  contentbox" style="padding-left:10px">
	<p>Модель из мира Line Age 2 - Raid Boss Unicorn из Enchansed Vally</p>
    <p>Выполнена в дополнение к другим Raid Boss'ам игры.<br>
	Развертку выполнил EteсRLS из сообщества only-paper. Сам не собирал. Фото так же не мое.<br>
	Идея собрать всех боссов еще не заброшена, только вот сервер никак не разворачивается, почему-то.<br>
	В наличии исходники боссов Lineage 2: Баюм, Крыса, Суккуб, Валакас...<br>
	Как-нибудь, доберусь до них</p>
</div>